fix(landing): increase page width and responsiveness
